//==================================================================================================
//| 文件名称 | Task_GreyProc.c
//|--------- |--------------------------------------------------------------------------------------
//| 文件描述 | 灰度处理
//|--------- |--------------------------------------------------------------------------------------
//| 版权声明 | 
//|----------|--------------------------------------------------------------------------------------
//|  版本    |  时间       |  作者     | 描述
//|--------- |-------------|-----------|------------------------------------------------------------
//|  V1.0    | 2018.11.02  |  wjb      | 初版 先验证是否能用DMA连续读取LT1867
//==================================================================================================
#include "app_cfg.h"

void Task_GreyProc(void  *p_arg)
{
    OS_ERR  os_err;
    
    while(TRUE)
    {
        INT8U i = 0;
        for(i = 0; i < 10; i++)
        {
            Mod_GreyAnalysisPoll(&ast_GreyChannle[i]);        
        }
        
        for(i = 0; i < 10; i++)
        {   
            static INT8U buff[100] = {0};
            sprintf(buff,"CH%u = %f\r\n",i,ast_GreyChannle[i].f_Volt);
            TRACE_DBG(buff);    
            OSTimeDlyHMSM(0u, 0u, 0u, 100,
                  OS_OPT_TIME_HMSM_STRICT | OS_OPT_TIME_PERIODIC,/* 周期模式 */
                  &os_err);  
        }
        
        OSTimeDlyHMSM(0u, 0u, 0u, 100,
              OS_OPT_TIME_HMSM_STRICT | OS_OPT_TIME_PERIODIC,/* 周期模式 */
              &os_err);
        TRACE_DBG(">>DBG:       灰度处理\r\n");
        
        BSP_Led2Toggle();
    }
}
